app/controllers/quotation_ms_controller.rb

	def index
		@quotationMs = QuotationM.page(page).per(15)
---
SELECT  `quotation_ms`.* FROM `quotation_ms` LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM `quotation_ms`

	def show
		@quotationM = QuotationM.find(params[:id])
---
SELECT  `quotation_ms`.* FROM `quotation_ms` WHERE `quotation_ms`.`id` = 13 LIMIT 1

	def create
		@quotationM = QuotationM.new(quotationM_params)
		@quotationM.save
---
INSERT INTO `quotation_ms` (`quotation_No`, `customer`, `customer_Factory`, `shipment`, `payment`, `quotation_Date`, `created_at`, `updated_at`) VALUES ('QO20150327001', '楊昭哲', '小哲哲', '自己拿', '路運', '2015-03-27 00:00:00.000000', '2015-03-27 07:40:35.266587', '2015-03-27 07:40:35.266587')

	def edit
		@quotationM = QuotationM.find(params[:id])
---
SELECT  `quotation_ms`.* FROM `quotation_ms` WHERE `quotation_ms`.`id` = 13 LIMIT 1

	def update
		@quotationM = QuotationM.find(params[:id])
		@quotationM.update(quotationM_params)
---
SELECT  `quotation_ms`.* FROM `quotation_ms` WHERE `quotation_ms`.`id` = 16 LIMIT 1
UPDATE `quotation_ms` SET `quotationNo` = '23232qEEWEE', `customer` = '41515EE', `customerFactory` = 'EEEE', `updated_at` = '2015-03-26 01:13:53.232862' WHERE `quotation_ms`.`id` = 35

	def destroy
		@quotationM = QuotationM.find(params[:id])
		@quotationM.destroy
---
SELECT  `quotation_ms`.* FROM `quotation_ms` WHERE `quotation_ms`.`id` = 13 LIMIT 1
DELETE FROM `quotation_ms` WHERE `quotation_ms`.`id` = 13